Revit 2024 API
FabricationRodInfo.RodCount Property
 Gets the number of rods.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int RodCount { get; }
Visual Basic
Public ReadOnly Property RodCount As Integer
	Get
Visual C++
public:
property int RodCount {
	int get ();
}
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace